





{
  "subject": "History",
  "topics": [

   

  {
    "title": "Growth of Trade in Pre-Colonial East and Central Africa – The Portuguese Factor",
    "subsections": [
      {
        "title": "How the Portuguese Came into Contact with East Africa",
        "content": "The Portuguese came to East Africa while searching for a sea route to India.",
        "points": [
          "Portugal is in Europe, southwest of Spain.",
          "They reached the East African coast (Land of Zanj) around 1497.",
          "Vasco da Gama was the first to arrive.",
          "He saw active trade in gold and wanted to control it.",
          "Portuguese settled in Sofala and Mozambique Island."
        ]
      },
      {
        "title": "Organisation of the Gold Trade",
        "content": "The local gold trade was organized through traditional systems involving kings and middlemen.",
        "points": [
          "Gold was mined using simple tools by locals.",
          "It was presented to the king who sold it to middlemen.",
          "Middlemen sold the gold to Arabs and Portuguese.",
          "Gold was exchanged for cloth, beads, guns, and wine.",
          "Portuguese built trading posts known as Feiras."
        ]
      },
      {
        "title": "Arab-Portuguese Conflict",
        "content": "A power struggle over trade dominance along the East African coast.",
        "points": [
          "Both Arabs and Portuguese wanted control of gold trade.",
          "Portuguese attacked Arab towns like Kilwa, Mombasa, and Sofala.",
          "Arabs were divided and had inferior weapons.",
          "Portuguese had superior weapons and discipline.",
          "Many towns fell under Portuguese control."
        ]
      },
      {
        "title": "Decline of Portuguese Influence",
        "content": "Portuguese power in Central Africa declined over time.",
        "points": [
          "Rise of Dutch and British traders reduced Portuguese monopoly.",
          "Slave trade made missionary work harder.",
          "Tropical diseases and hot climate discouraged settlers.",
          "Portugal sent ex-prisoners who lacked skills.",
          "Rozwi tribe and others resisted and defeated them.",
          "Arabs returned and recaptured coastal towns."
        ]
      },
      {
        "title": "Impact of the Gold Trade on Central Africa",
        "content": "The gold trade had both positive and negative consequences.",
        "points": [
          "**Positive:**",
          "Christianity spread to new areas.",
          "New crops like maize and cassava were introduced.",
          "Kings became richer and more powerful.",
          "Gold mining increased.",
          "**Negative:**",
          "Use of guns led to more wars.",
          "Portuguese interfered in local politics.",
          "Gold resources were overused.",
          "Many people were captured and sold as slaves."
        ]
      },
      {
        "title": "The Portuguese in Central Africa",
        "content": "Portuguese explorers and missionaries played key roles in Central Africa.",
        "points": [
          "Antonio Fernandez explored mines and suggested forts (1511–1515).",
          "Father da Silveira converted Mwenemutapa but was killed in 1561.",
          "Francisco Barreto failed to avenge Silveira due to malaria and resistance.",
          "Portuguese used puppet king Mavura (1632) to control trade and mining.",
          "Mwenemutapa kingdom became a Portuguese vassal."
        ]
      }
    ]
  },
  {
    "title": "The Missionary Factor in Malawi: Islam",
    "subsections": [
      {
        "title": "Roles of Various Groups in the Spread of Islam",
        "content": "Islam was spread mainly through trade and missionary activities.",
        "points": [
          "Swahili-Arabs spread Islam while trading ivory and slaves.",
          "Jumbe of Nkhotakota promoted Islamic training and Arabic literacy.",
          "Mlozi of Karonga declared himself sultan but had limited impact.",
          "Yao people were first ethnic group to adopt Islam.",
          "Yao chiefs like Makanjira, Mataka, and Jalasi converted early."
        ]
      },
      {
        "title": "Factors Leading to the Spread of Islam Among the Yao",
        "content": "Cultural and economic ties encouraged the spread of Islam.",
        "points": [
          "Strong trade ties with Swahili-Arabs.",
          "Yao culture shared practices like circumcision with Islam.",
          "Yao belief in Mulungu aligned with Islam’s monotheism.",
          "Arabic literacy brought prestige and communication skills.",
          "Chiefs influenced their subjects to convert.",
          "Resistance to colonialism strengthened Islamic identity.",
          "Missionaries like Sheikh Mkwanda played key roles.",
          "Competition between Quadriya and Shadhliya brotherhoods.",
          "Job offers from Asian traders attracted converts."
        ]
      },
      {
        "title": "Impact of Islam on Malawi",
        "content": "Islam significantly shaped culture, religion, and social structures in Malawi.",
        "points": [
          "Introduced Islamic rituals and circumcision.",
          "Led to the building of mosques across Malawi.",
          "Influenced Islamic dress codes and dietary laws.",
          "Promoted polygamy and discouraged divorce.",
          "Encouraged Arabic literacy and daily prayers.",
          "Converted many from African Traditional Religions."
        ]
      }
    ]
  },

{
  "title": "Ivory and Slave Trade in East and Central Africa",
  "subsections": [
    {
      "title": "Development of Ivory and Slave Trade",
      "content": "Slavery and ivory trading were practiced in East and Central Africa before foreign intervention, but greatly expanded with Arab and Portuguese involvement.",
      "points": [
        "Slavery was initially localized and not for export.",
        "Demand for ivory increased due to European industrial needs.",
        "Decline in gold mining led to more focus on ivory trade.",
        "Ivory was in high demand in Europe for items like piano keys and ornaments.",
        "Elephants were abundant in areas like Lilongwe-Kasungu and Lake Chilwa.",
        "Chiefs promoted ivory trade due to economic benefits.",
        "Swahili-Arabs moved inland as coastal ivory sources diminished.",
        "Slaves were increasingly used as porters for ivory.",
        "French and Portuguese plantations needed slaves.",
        "Zanzibar and Pemba plantations demanded more labor.",
        "Major traders included Jumbe, Mlozi, and Tippu Tip."
      ]
    },
    {
      "title": "Organisation of Ivory and Slave Trade",
      "content": "Trade evolved from coastal exchanges to deep interior involvement, involving local leaders, middlemen, and foreign traders.",
      "points": [
        "Trade began with Africans delivering goods to the coast.",
        "Swahili-Arabs and Portuguese later established inland trade routes.",
        "Firearms were used in raids to capture slaves.",
        "Chiefs played a role by raiding and collecting ivory as tribute.",
        "Middlemen tribes included:",
        "▪ Bisa – turned to slave trade after elephant numbers declined.",
        "▪ Nyamwezi – active in Tanzania, traded with Swahili-Arabs.",
        "▪ Bemba – engaged in slave trade due to poor soils and disease.",
        "▪ Chikunda – raided communities on behalf of Portuguese.",
        "▪ Yao – peaceful traders who later became raiders.",
        "Slaves were chained in caravans and forced to carry ivory.",
        "Sick or weak slaves were abandoned or killed during transport."
      ]
    },
    {
      "title": "Impact of Ivory and Slave Trade on Indigenous People",
      "content": "The trade brought both development and destruction to local communities.",
      "points": [
        "Positive impacts included:",
        "▪ Growth of towns such as Karonga, Nkhotakota, and Mangochi.",
        "▪ Introduction of crops like maize, cassava, and citrus fruits.",
        "▪ Spread of religions like Christianity and Islam.",
        "▪ Exposure to new cultures and goods.",
        "▪ Encouragement of legitimate trade alternatives.",
        "Negative impacts included:",
        "▪ Depopulation due to frequent slave raids and violence.",
        "▪ Destruction of traditional cultural systems.",
        "▪ Famines caused by insecurity and inability to farm.",
        "▪ Ecological damage from elephant overhunting.",
        "▪ Spread of diseases like smallpox and syphilis.",
        "▪ Colonization justified through anti-slavery campaigns."
      ]
    }
  ]
},


{
  "title": "Imposition of the Central African Federation",
  "subsections": [
    {
      "title": "Definition and Background",
      "content": "A federation is a union of states under one government.",
      "points": [
        "The federal government handled currency, customs, defence, and foreign policy.",
        "Cecil Rhodes wanted Southern and Central Africa to unite.",
        "Early proposals to join Rhodesias were rejected due to economic imbalance.",
        "Settlers in Southern Rhodesia preferred union with South Africa, rejected in 1922."
      ]
    },
    {
      "title": "Key Developments",
      "content": "",
      "points": [
        "Devonshire Declaration (1923): African interests to come first.",
        "Hilton Commission (1929): Federation rejected due to communication issues and African resistance.",
        "Passfield Memorandum (1930): Reaffirmed African interests are paramount.",
        "Victoria Falls Conference (1936): Leaders supported union of Rhodesias.",
        "Bledisloe Commission (1938): Opposed federation; suggested coordination council.",
        "Victoria Falls Conference (1949): Shifted focus from amalgamation to federation; Africans excluded.",
        "Victoria Falls Conference (1951): Africans included, still opposed federation.",
        "London Conference (1951–1953): Oliver Lyttelton decided to impose federation.",
        "Africans protested through strikes, boycotts, and petitions.",
        "Chiefs travelled to London to oppose federation.",
        "Federation was imposed in October 1953."
      ]
    },
    {
      "title": "Reasons for the Imposition of the Federation",
      "content": "",
      "points": []
    },
    {
      "title": "Political Reasons",
      "content": "",
      "points": [
        "Strengthen British control in Central Africa.",
        "Preserve British civilization and influence.",
        "Model for future federations (e.g., East Africa).",
        "Promote racial partnership over apartheid.",
        "Unite policies on trade, research, and communication."
      ]
    },
    {
      "title": "Economic Reasons",
      "content": "",
      "points": [
        "Combine industries, minerals, and labour across territories.",
        "Attract investors and improve the economy.",
        "Ensure even development and self-reliance."
      ]
    },
    {
      "title": "Reasons for African Opposition",
      "content": "",
      "points": [
        "Feared Southern Rhodesia’s racial discrimination would spread.",
        "Feared delay in achieving self-rule.",
        "Believed Africans would have little power in the federation.",
        "Protests included:",
        "Formation of supreme council of chiefs in Nyasaland.",
        "Boycotts and non-payment of taxes.",
        "Unrest and petitions to British government."
      ]
    },
    {
      "title": "Structure of the Federation",
      "content": "",
      "points": [
        "Headed by a Governor-General (based in Salisbury).",
        "Federal Government: Handled defence, non-African education, customs, etc.",
        "Federal Assembly: 35 members – mostly Europeans; only 6 Africans.",
        "Federal Executive: Prime Minister and appointed ministers.",
        "Territorial Governments handled African affairs: agriculture, land, education, etc.",
        "Each had a Governor, Executive Council, and Legislative Council."
      ]
    },
    {
      "title": "Assessment of the Federation",
      "content": "",
      "points": []
    },
    {
      "title": "Successes",
      "content": "",
      "points": [
        "Hospitals built in Harare, Kitwe, and Blantyre.",
        "Kariba Dam built for power supply.",
        "Agricultural projects in Sabi (Southern Rhodesia), Kafue (Northern Rhodesia), Shire Valley (Nyasaland)."
      ]
    },
    {
      "title": "Failures",
      "content": "",
      "points": [
        "Development favoured Southern Rhodesia (e.g., Kariba Dam).",
        "Racial segregation persisted:",
        "Skilled jobs given to Europeans.",
        "More money spent on European education than African education.",
        "Africans had little say in government."
      ]
    },
    {
      "title": "Monckton Commission (1960)",
      "content": "",
      "points": [
        "Found strong African opposition.",
        "Recommended members be allowed to leave.",
        "Federation dissolved on 31 December 1963."
      ]
    }
  ]
},

{
  "title": "African Independent Churches in Malawi",
  "subsections": [
    {
      "title": "Learning Outcomes",
      "content": "By the end of the lesson, students should be able to:",
      "points": [
        "Define the term African Independent Churches.",
        "Explain the factors that led to the formation of African Independent Churches in Malawi.",
        "Outline examples of African Independent Churches and describe their role in promoting nationalism."
      ]
    },
    {
      "title": "Meaning of African Independent Churches",
      "content": "African Independent Churches were churches established, led, and controlled by Africans as breakaway movements from conventional European missionary churches.",
      "points": [
        "Also known as Ethiopian Churches – symbolizing African liberation inspired by Ethiopia’s resistance to colonization.",
        "Millennial Churches – believed in a coming era of prosperity and freedom after colonial rule.",
        "Syncretic Churches – combined African customs with Christian practices, such as polygamy.",
        "Separatist Churches – separated from missionary churches due to doctrinal disagreements."
      ]
    },
    {
      "title": "Characteristics of African Independent Churches",
      "content": "",
      "points": [
        "Led and controlled by Africans.",
        "Emphasized the Bible as the supreme authority (fundamentalist).",
        "Politically inclined—supported Black Nationalism.",
        "Prophesied the end of colonial oppression.",
        "Incorporated African cultural elements in worship."
      ]
    },
    {
      "title": "Factors Leading to Formation of Independent Churches in Malawi",
      "content": "",
      "points": [
        "Desire to serve African interests: spiritual and administrative autonomy.",
        "Influence of Western education: educated Africans challenged European missionary control.",
        "Doctrinal misunderstandings such as baptism methods (sprinkling vs immersion) and Sabbath vs Sunday worship.",
        "Opposition to African customs like polygamy and traditional ceremonies.",
        "Racial discrimination and delayed ordination of Africans.",
        "Unequal responsibilities and restricted leadership roles."
      ]
    },
    {
      "title": "Examples of African Independent Churches and Their Role in Nationalism",
      "content": "",
      "points": [
        "Providence Industrial Mission (PIM) – Founded by John Chilembwe in 1900; platform for political discussion leading to the Chilembwe Uprising.",
        "Watch Tower Movement – Founded by Elliot Kamwana in 1907; preached liberation and tax resistance, leading to Kamwana Revolt.",
        "African Methodist Episcopal Church – Founded by Hannock Msokera Phiri in 1924; promoted education and broke from European control.",
        "The Last Church of God and His Christ – Founded by Jordan Msumbu in 1924; promoted African traditions like polygamy.",
        "Blackman’s Church of Africa – Founded by Yesaya Zerenji Mwase in 1933; criticized missionary racism and supported nationalist politics.",
        "Sazu Home Mission – Founded by Charles Chinula in 1934; advocated evangelism, education, and nationalist politics.",
        "Children of God (Ana a Mulungu) – Founded by Wilfred Good in 1935; opposed tax and colonial oppression."
      ]
    },
    {
      "title": "Role of Independent Churches in Promoting Nationalism",
      "content": "",
      "points": [
        "Served as platforms for political awakening and organizing resistance.",
        "Promoted education as a tool for empowerment.",
        "Criticized colonial authorities and policies.",
        "Encouraged self-reliance and African identity.",
        "Helped unify people across different ethnic groups under a common cause.",
        "Provided leadership training for future nationalist leaders.",
        "Supported grassroots mobilization against colonial rule."
      ]
    }
  
  ]
},


{
  "title": "Nationalism and the Independence Movement in Malawi",
  "subsections": [
    {
      "title": "Factors That Contributed to the Rise of Nationalist Movements in Malawi",
      "content": "Several political, social, and economic factors led to the rise of nationalism in Malawi.",
      "points": [
        "The Federation of Rhodesia and Nyasaland (1953) was seen as a threat to African self-rule.",
        "Created fear of white domination among Africans.",
        "Colonial government policies included discriminatory laws and racial segregation.",
        "Forced labour and poor wages for Africans created resentment.",
        "Land alienation from Africans deprived them of their rights.",
        "Effects of World War I and II: Africans served in the wars and returned with new political ideas.",
        "War veterans demanded better treatment after the wars.",
        "The Chilembwe Uprising (1915) was an early resistance against colonial rule and inspired future nationalists.",
        "Western education created an educated African elite that increased political awareness."
      ]
    },
    {
      "title": "Voluntary Associations between 1912 and 1943",
      "content": "African voluntary associations were formed to improve welfare and express concerns.",
      "points": [
        "Promoted African education, health, and economic activities.",
        "Spoke against injustice and discrimination.",
        "Preserved African culture and customs."
      ],
      "examples": [
        {"Name": "North Nyasa Native Association", "Year Formed": 1912, "District": "Karonga"},
        {"Name": "Central Province Native Association", "Year Formed": 1927, "District": "Kasungu"},
        {"Name": "Blantyre Native Association", "Year Formed": 1928, "District": "Blantyre"},
        {"Name": "Chiradzulu Native Association", "Year Formed": 1931, "District": "Chiradzulu"},
        {"Name": "Zomba Native Association", "Year Formed": 1934, "District": "Zomba"},
        {"Name": "Mzimba Native Association", "Year Formed": 1935, "District": "Mzimba"},
        {"Name": "Lilongwe Native Association", "Year Formed": 1936, "District": "Lilongwe"}
      ],
      "strengths": [
        "Encouraged African unity and identity.",
        "Laid foundation for future political movements.",
        "Gave a voice to the African population."
      ],
      "weaknesses": [
        "Focused mainly on educated elites.",
        "Lacked mass support.",
        "Avoided confrontations with colonial authorities."
      ]
    },
    {
      "title": "Factors That Led to the Formation of the Nyasaland African Congress (NAC)",
      "content": "The need to unite Native Associations and increased political awareness led to NAC formation.",
      "points": [
        "Need to unite all Native Associations under one organisation.",
        "Increased awareness of colonial injustices.",
        "Influence of African nationalism in other countries.",
        "Inspired by the Chilembwe uprising.",
        "Educated Africans wanted political representation.",
        "Harsh colonial economic and land policies.",
        "Discontent with the Federation of Rhodesia and Nyasaland."
      ],
      "leading_personalities": [
        "Levi Ziliro Mumba",
        "James Fredrick Sangala",
        "Charles J. Matinga",
        "Charles Mlanga",
        "Issa MacDonald Lawrence",
        "John Dickson Phiri",
        "Harry Tung’ande",
        "H.B. Dallah"
      ]
    },
    {
      "title": "Aims of the Nyasaland African Congress (NAC)",
      "content": "NAC aimed to promote African interests and fight for equality and self-government.",
      "points": [
        "Promote and protect African interests.",
        "Demand political, economic, and social equality.",
        "Oppose racial segregation and discrimination.",
        "Work for African self-government."
      ]
    },
    {
      "title": "Roles of Different Political Figures in NAC Activities",
      "content": "Key leaders played various roles in the NAC movement.",
      "points": [
        "Hastings Kamuzu Banda: Became leader in 1958, mobilised the masses, demanded total independence.",
        "Charles Matinga: Early president of NAC, promoted unity and political activism.",
        "James Chinyama: Played leadership role before Banda’s return.",
        "Charles Chinula: Helped organise protests and awareness campaigns."
      ]
    },
    {
      "title": "Problems Faced by the NAC in the 1940s and 1950s",
      "content": "NAC faced internal and external challenges during its early years.",
      "points": [
        "Death of key leaders such as Levi Mumba.",
        "Internal conflicts and leadership struggles.",
        "Lack of funding for political activities.",
        "Failed to reach rural masses.",
        "Government restrictions on political gatherings."
      ]
    },
    {
      "title": "Factors That Stimulated NAC Activities in the 1950s",
      "content": "Several factors revived NAC and increased activism in the 1950s.",
      "points": [
        "Unpopular colonial agricultural policies (e.g., soil conservation).",
        "Rise of the “Young Turks” – educated youths pushing for change.",
        "Opposition to the Federation of Rhodesia and Nyasaland.",
        "Return of Kamuzu Banda, who revived the movement."
      ]
    },
    {
      "title": "Roles of Prominent Political Figures in the Independence Struggle",
      "content": "Several leaders made major contributions to Malawi’s independence.",
      "points": [
        "Hastings Kamuzu Banda: Nationalist leader, led Malawi to independence, first Prime Minister and later President.",
        "Rose Chibambo: Mobilised women in nationalist movement, promoted political education.",
        "Orton Chirwa: Legal advisor and political thinker, key leader in MCP.",
        "Kanyama Chiume: Influenced youth, promoted African unity, vocal critic of colonial rule.",
        "Henry Masauko Chipembere: Outspoken political activist, mobilised support through speeches and writings."
      ]
    },
    {
      "title": "Declaration of the State of Emergency (3rd March 1959)",
      "content": "Colonial government cracked down on nationalist activities during Operation Sunrise.",
      "points": [
        "1959 riots by NAC supporters.",
        "Alleged 'murder plot' to kill colonial officers.",
        "Rising tension and fear of rebellion.",
        "Arrest of Kamuzu Banda and other leaders.",
        "Ban on NAC.",
        "Military control imposed."
      ]
    },
    {
      "title": "Factors for the Formation of the Malawi Congress Party (MCP)",
      "content": "MCP was formed after NAC was banned to continue the nationalist struggle legally.",
      "points": [
        "NAC was banned in 1959.",
        "Need for a new political party to continue the struggle.",
        "To unite nationalists under a legal organisation."
      ],
      "founding_figures": [
        "Orton Chirwa",
        "Aleke Banda"
      ]
    },
    {
      "title": "Political Parties Formed Before Independence",
      "content": "Several parties existed with differing visions and influences before independence.",
      "points": [
        "Malawi Congress Party (MCP): Formed in 1959 to replace banned NAC, led by Hastings Kamuzu Banda, main party that led Malawi to independence.",
        "Christian Democratic Party: Small party supporting Christian values and democratic governance, had little influence.",
        "United Federal Party (UFP): Supported continuation of Federation of Rhodesia and Nyasaland, mainly supported by Europeans and some conservative Africans.",
        "Congress Liberation Party: Breakaway faction from MCP, formed by individuals who disagreed with MCP leadership."
      ]
    },
    {
      "title": "Processes That Led to Nyasaland’s Independence",
      "content": "Several commissions, talks, and elections paved the way for independence.",
      "points": [
        "Devlin Commission (1959): Investigated causes of 1959 uprising, blamed colonial policies.",
        "Monkton Commission (1960): Assessed the future of the Federation, recommended its dissolution.",
        "Constitutional talks (1960–1963): Negotiated steps to self-government.",
        "General Elections: Held in 1961 and 1964, MCP won majority.",
        "Independence achieved on 6th July 1964."
      ]
    }
  ]
},

{
  "title": "European Occupation and Administration of Central Africa: The case of Zimbabwe",
  "subsections": [
    {
      "title": "Introduction",
      "content": "Definition of European occupation: The process by which European powers took control of African territories during the late 19th and early 20th centuries.",
      "points": [
        "Southern Rhodesia is the area now known as Zimbabwe, colonised primarily by the British."
      ]
    },
    {
      "title": "Reasons for European Occupation of Southern Rhodesia",
      "content": "",
      "points": [
        "Economic motives: prospect of mineral wealth (especially gold), agricultural potential, and control of trade routes.",
        "Political motives: competition among European powers (Scramble for Africa), strategic importance in controlling central and southern Africa.",
        "Social and religious motives: missionary activities, spread of Western civilisation and Christianity.",
        "Role of Cecil Rhodes and the British South Africa Company (BSAC): Rhodes’ vision of British-controlled Africa 'from Cape to Cairo', use of BSAC to gain control of the territory."
      ]
    },
    {
      "title": "Methods Used to Occupy Southern Rhodesia",
      "content": "",
      "points": [
        "Diplomatic agreements through treaties with African leaders (e.g., Rudd Concession of 1888).",
        "Use of chartered companies: BSAC given a Royal Charter in 1889 to administer and exploit the territory.",
        "Military force: armed resistance from African groups (e.g., Ndebele and Shona uprisings) defeated using superior European weaponry."
      ]
    },
    {
      "title": "Establishment of Colonial Administration",
      "content": "",
      "points": [
        "Company rule (1890–1923): administration by BSAC, introduction of settler governance, imposition of taxes (hut tax, poll tax).",
        "Crown colony rule (1923–1980): Southern Rhodesia became a self-governing British colony with white settler minority controlling the government, Africans excluded from political participation."
      ]
    },
    {
      "title": "Effects of European Occupation and Administration",
      "content": "",
      "points": [
        "Political effects: loss of African sovereignty, creation of European-style governance, denial of African political rights.",
        "Economic effects: exploitation of African labour, land alienation to settlers, introduction of cash crop agriculture and taxation.",
        "Social and cultural effects: disruption of African traditional systems, spread of Western education and religion, rise of African nationalism and resistance movements."
      ]
    },
    {
      "title": "African Resistance to Occupation",
      "content": "",
      "points": [
        "Early resistance included Ndebele and Shona uprisings (First Chimurenga, 1896–1897).",
        "Later nationalist movements involved formation of political organisations in the 20th century and rise of leaders like Joshua Nkomo and Robert Mugabe."
      ]
    },
    {
      "title": "Background of European Occupation in Southern Rhodesia",
      "content": "The land between the Limpopo and Zambezi Rivers attracted interest from the British, Portuguese, and Boers. The British occupied it through the British South Africa Company (BSAC), formed by Cecil John Rhodes. The territory was later named Rhodesia.",
      "points": [
        "Rhodes aimed to build the Cape to Cairo Railway for imperial expansion.",
        "He sought to encircle Transvaal and force it into a British federation.",
        "Rhodes believed in British civilization superiority motivated by economic and imperialistic goals."
      ]
    },
    {
      "title": "Key Treaties Signed with Lobengula",
      "content": "",
      "points": [
        "Grobler Treaty (1887): allowed Boer representative in Bulawayo.",
        "Moffat Treaty (1888): declared friendship with Britain and forbade Lobengula from making treaties without British approval.",
        "Rudd Concession (1888): granted exclusive mining rights to Rhodes’ team in exchange for promises to Lobengula which were largely deceptive."
      ]
    },
    {
      "title": "Formation of British South Africa Company (BSAC)",
      "content": "",
      "points": [
        "Formed after the Rudd Concession by Rhodes with backing from De Beers, Rothschilds, etc.",
        "Granted Royal Charter in October 1889 with powers to occupy territory, exploit minerals, and maintain law and order."
      ]
    },
    {
      "title": "Stages of Occupation",
      "content": "",
      "points": [
        "Occupation of Mashonaland (1890) by Pioneer Column, raising British flag at Fort Victoria.",
        "Occupation of Manicaland following Anglo-Portuguese Treaty (1891), resolving disputes and opening port of Beira.",
        "Occupation of Matabeleland with focus on gold and fertile land; led to conflicts with Ndebele."
      ]
    },
    {
      "title": "Causes of the Matabele War of 1893",
      "content": "",
      "points": [
        "Ndebele angered by European settlement and protection of Shona.",
        "Settler insecurity and Rhodes’ imperial ambitions to dominate the region.",
        "Economic motives for gold and land.",
        "Conflicts such as killing of Shona chiefs by Ndebele."
      ]
    },
    {
      "title": "Course and Results of the Matabele War",
      "content": "",
      "points": [
        "BSAC forces with modern weapons defeated Ndebele warriors with traditional arms.",
        "Bulawayo was taken and Lobengula fled and died of smallpox.",
        "Ndebele were relocated to poor reserves; land and cattle seized."
      ]
    },
    {
      "title": "The Shona-Ndebele Revolts of 1896–1897",
      "content": "Background: Whites settled and built infrastructure, Africans worked under oppressive conditions but were unhappy under company rule.",
      "points": [
        "Ndebele grievances included loss of land, cattle, and lack of a king.",
        "Shona grievances included taxes and forced labour.",
        "Common grievances included restrictions on trade and natural disasters seen as spiritual punishment.",
        "Revolts led by spiritual leaders Mkwati, Nehanda, and Kagubi.",
        "Revolts started with Ndebele in March 1896 and Shona in June 1896."
      ]
    },
    {
      "title": "Course and Outcome of the Revolts",
      "content": "",
      "points": [
        "Shona and Ndebele attacked settlers, who defended using superior weapons.",
        "Revolts were defeated; chiefs lost power and spiritual leaders were punished.",
        "Created long-lasting racial tensions, ending with Zimbabwe’s independence in 1980."
      ]
    },
    {
      "title": "Reasons for Defeat and Settler Surprise",
      "content": "",
      "points": [
        "Europeans had better guns and reinforcements.",
        "Some African groups did not join the revolts.",
        "Settlers underestimated Shona due to perceived peacefulness."
      ]
    },
    {
      "title": "Colonial Administrative Policies in Southern Rhodesia",
      "content": "Summary of policies controlling land, labour, and taxation to benefit settlers.",
      "points": [
        "Land Policies: Africans lost fertile land to white settlers, forced into poor reserves, Land Apportionment Act (1931) favored Europeans.",
        "Labour Policies: Forced labour introduced, poor working conditions, chiefs punished if workers not supplied, recruitment of foreign workers.",
        "Taxation Policies: Hut tax and poll tax used to compel Africans to work for settlers, harsh punishments for non-payment, causing poverty and family disruption."
      ]
    }
  ]
},

{
  "title": "British Occupation and Administration of Northern Rhodesia: THE CASE OF ZAMBIA",
  "subsections": [
    {
      "title": "Locating Northern Rhodesia in British Central Africa",
      "content": "Northern Rhodesia was located in British Central Africa, which includes modern-day Zambia.",
      "points": [
        "Bordered by Southern Rhodesia (now Zimbabwe), Nyasaland (now Malawi), and the Belgian Congo.",
        "Map activity: Locate Northern Rhodesia above Southern Rhodesia on a map of British Central Africa."
      ]
    },
    {
      "title": "Factors Leading to British Interest in Northern Rhodesia",
      "content": "",
      "points": [
        "Copper mining: rich copper deposits attracted British industrial interest.",
        "Agriculture: fertile lands ideal for tobacco and cotton farming.",
        "Suppression of slave trade: British aimed to control slave trade and impose order.",
        "Copper Belt and Railway: key mining area identified on the map."
      ]
    },
    {
      "title": "Aims of Occupation",
      "content": "Driven mainly by economic factors related to copper mining.",
      "points": [
        "Occupation from two angles: North-Western and North-Eastern Rhodesia."
      ]
    },
    {
      "title": "Occupation of North-Western Rhodesia (Barotseland)",
      "content": "Peaceful British penetration under reign of Lozi king Lewanika.",
      "points": [
        "Lewanika sought British protection from Ndebele raids, Portuguese threats, and internal unrest.",
        "Encouraged by Khama of Bechuanaland and missionary Francois Coillard."
      ]
    },
    {
      "title": "Key Treaties Signed in North-Western Rhodesia",
      "content": "",
      "points": [
        "Ware Concession (1889): mining rights for 20 years; Lewanika received £200 annually.",
        "Lochner Treaty (1890): exclusive mining and commercial rights for the company with promise of protection.",
        "Lawley Treaty (1898): repeated Lochner points; granted company administration and jurisdiction."
      ]
    },
    {
      "title": "Results of the Treaties in North-Western Rhodesia",
      "content": "",
      "points": [
        "British South Africa Company (BSA) gained mineral and administrative rights.",
        "Lewanika wanted protection from British government, not company control.",
        "Rhodes tricked Lewanika into signing with BSA Company agents, not official government representatives."
      ]
    },
    {
      "title": "Occupation of North-Eastern Rhodesia",
      "content": "Occupied through military force and conquest unlike North-Western Rhodesia.",
      "points": [
        "Led by Harry Johnston with Alfred Sharpe negotiating with Luangwa and Katanga chiefs.",
        "Resistance from local chiefs led to military action financed by BSA Company."
      ]
    },
    {
      "title": "How Europeans Dealt with Key Groups",
      "content": "",
      "points": [
        "Arab traders resisted stopping slave raids; defeated by BSA forces but continued operating.",
        "The Bemba refused British rule, resisted signing treaties, and continued slave trade until defeated.",
        "The Lunda king Kazembe signed treaty but resisted slave raid bans; fled and later accepted British authority.",
        "The Ngoni under Nsingu rebelled in 1897 but were defeated and subdued."
      ]
    },
    {
      "title": "Administration of Northern Rhodesia",
      "content": "",
      "points": [
        "1891–1894: Administered via Harry Johnston based in Nyasaland.",
        "1894: BSA Company given full control and appointed administrators including Major Forbes and Robert Coryndon.",
        "1911: North-Western and North-Eastern Rhodesia merged to form Northern Rhodesia with capital at Livingstone.",
        "Name changed to Zambia on 24 October 1964 (Independence Day)."
      ]
    },
    {
      "title": "Colonial Administrative Policies in Northern Rhodesia",
      "content": "Policies administered by BSA Company with differences from Southern Rhodesia due to size and population.",
      "points": [
        "Land Policies: European immigration promoted; land reserved near railway and towns.",
        "First African reserve created in 1911; later reserves established to combat soil erosion and deforestation.",
        "Labour Policies: Northern Rhodesia served as labour source for Katanga mines and Southern Rhodesia.",
        "Contract labour systems introduced; poor conditions and recruitment controls enforced.",
        "Taxation Policies: Hut tax introduced in 1889 to coerce Africans into wage labour; harsh collection tactics employed."
      ]
    },
    {
      "title": "British Occupation of North-Eastern Rhodesia",
      "content": "Forceful conquest led by Harry Johnston; treaties negotiated but many chiefs resisted.",
      "points": [
        "Arab traders and Bemba chiefs resisted but were militarily subdued.",
        "Lunda king Kazembe initially resistant but later accepted British rule.",
        "Ngoni people rebelled but were defeated, leading to British control."
      ]
    },
    {
      "title": "Administrative Policies of BSA Company up to 1924",
      "content": "",
      "points": [
        "Land policies favoured European settlers along railway corridors; African reserves created but land quality deteriorated.",
        "Labour policies focused on recruiting African workers for mines and farms, often under harsh conditions.",
        "Taxation policies forced Africans into labour by imposing hut taxes and enforcing payments through coercion."
      ]
    },
    {
      "title": "Key Personalities and Events",
      "content": "",
      "points": [
        "Cecil Rhodes: Led BSA Company, aimed to expand British influence through treaties and conquest.",
        "Lewanika: Lozi king seeking British protection.",
        "Harry Johnston: Led conquest of North-Eastern Rhodesia using diplomacy and force.",
        "Alfred Sharpe: Negotiated treaties with local chiefs.",
        "Bemba and Lunda chiefs: Resisted British authority but eventually subdued."
      ]
    }
  ]
},

{
  "title": "European Occupation and Administration of Central Africa: The Case of Nyasaland (Malawi)",
  "subsections": [
    {
      "title": "Introduction",
      "content": "Nyasaland is the present-day Malawi. It became a British colony due to the interests of missionaries, explorers, and traders.",
      "points": [
        "Officially became the British Central Africa Protectorate in 1891.",
        "Renamed Nyasaland in 1907."
      ]
    },
    {
      "title": "Reasons for British Occupation of Nyasaland",
      "content": "",
      "points": [
        "Protection of missionary interests against Arab slave traders.",
        "Suppression of the Arab slave trade along Lake Nyasa.",
        "Strategic interests to prevent Portuguese and German control.",
        "Economic motives to control resources like ivory, rubber, and agriculture.",
        "Influence of key individuals such as Harry Johnston."
      ]
    },
    {
      "title": "Methods Used to Occupy Nyasaland",
      "content": "",
      "points": [
        "Diplomacy and treaties with local chiefs, sometimes coercive.",
        "Military campaigns against resistant groups such as Yao and Ngoni.",
        "Missionary encouragement for chiefs to accept British protection.",
        "Official declaration as British protectorate in 1891."
      ]
    },
    {
      "title": "Challenges Faced by the British",
      "content": "",
      "points": [
        "Strong resistance from local groups (Yao, Ngoni, Swahili traders).",
        "Geographical difficulties including poor transport and dense forests.",
        "Health problems like malaria affecting personnel.",
        "Shortages of funds and administrative staff."
      ]
    },
    {
      "title": "Colonial Administration in Nyasaland",
      "content": "",
      "points": [
        "Governor appointed as British Crown representative.",
        "Indirect rule using local chiefs with limited power.",
        "Establishment of native authorities and local courts.",
        "Focus on cash crop agriculture development (cotton, tobacco, tea).",
        "Infrastructure development: railways and roads for settler economy."
      ]
    },
    {
      "title": "Effects of British Occupation on Nyasaland",
      "content": "",
      "points": [
        "Loss of African independence and undermining of traditional systems.",
        "Introduction of cash crops and taxes forcing wage labor.",
        "Spread of Western education and Christianity.",
        "Land alienation for European settlers and companies.",
        "Infrastructure mainly benefiting colonial economy.",
        "Suppression of resistance such as the Chilembwe Uprising (1915)."
      ]
    },
    {
      "title": "Colonial Administrative Policies in Nyasaland - Land Policies",
      "content": "Land was claimed by missionaries and settlers from chiefs; Europeans favored with land certificates and rents.",
      "points": [
        "Harry Johnston administrator from 1891; initially supported African farmers but shifted policy.",
        "Certificate of Claim granted Europeans land ownership; non-disturbance clause protected African villages.",
        "Africans paid rent (thangata) by laboring for landowners.",
        "By 1894, Europeans owned 15% of best land; by 1941, 31% of Africans lived on estates.",
        "Effects included land shortages, overcrowding, soil degradation, hunger, and restrictions on shifting cultivation."
      ]
    },
    {
      "title": "Colonial Administrative Policies in Nyasaland - Labour Policies",
      "content": "Africans forced to work during rainy season when farming was crucial; wages low and working conditions poor.",
      "points": [
        "Thangata system required 2 months labor yearly (1 month rent, 1 month tax).",
        "Forced cash crop cultivation on estates led to hunger and poverty.",
        "Significant migration to South Africa for work from 1903."
      ]
    },
    {
      "title": "Colonial Administrative Policies in Nyasaland - Taxation Policies",
      "content": "Taxes funded colonial administration and coerced labor.",
      "points": [
        "Poll tax introduced in 1892 at 6 shillings per adult male.",
        "Tax reduced for Africans working a month on estates.",
        "Tax defaulters punished harshly: hostages taken, huts burned.",
        "Missionaries sometimes supported Africans against unfair taxes."
      ]
    },
    {
      "title": "African Resistance to Colonial Rule – The Chilembwe Revolt of 1915 - Background",
      "content": "John Chilembwe, born 1870 in Chiradzulu district, educated in Malawi and USA, founded Providence Industrial Mission promoting education and farming.",
      "points": [
        "Influenced by Black American movements advocating racial equality.",
        "Opposed colonial injustices and forced recruitment in WWI."
      ]
    },
    {
      "title": "Causes of the Chilembwe Revolt",
      "content": "",
      "points": [
        "Oppressive thangata labor system with poor pay and reduced food production.",
        "Harsh colonial taxes and land alienation by Europeans.",
        "Conflicts with estate manager W.J. Livingstone.",
        "Influence of Black consciousness and religious prophecies.",
        "Forced African recruitment into WWI without fair compensation.",
        "Fear of Chilembwe’s deportation."
      ]
    },
    {
      "title": "Course of the Revolt",
      "content": "Started January 23, 1915, led by Chilembwe and associates; attacks on estates and missions; lasted two weeks.",
      "points": [
        "Killed estate manager W.J. Livingstone.",
        "Failed to secure weapons or wide support.",
        "Chilembwe killed February 3, 1915."
      ]
    },
    {
      "title": "Reasons for Failure of the Revolt",
      "content": "",
      "points": [
        "Poor planning and organization.",
        "Limited military strength.",
        "Lack of widespread support."
      ]
    },
    {
      "title": "Results and Significance of the Revolt",
      "content": "",
      "points": [
        "Mission properties destroyed but rebuilt later.",
        "Chilembwe and followers killed; some missionaries deported.",
        "Thangata briefly abolished but later reinstated.",
        "Increased government involvement in African education.",
        "Marked beginning of organized African resistance and challenged myths of passive acceptance."
      ]
    },
   {
  "title": "Colonial Agriculture Policies up to Independence - Before Colonization",
  "content": "Europeans claimed large land areas; no valuable minerals, focus on agriculture; Africans practiced subsistence farming and shifting cultivation.",
  "points": [
    "European settlers, missionaries, and traders acquired vast tracts of fertile land, especially in the Shire Highlands.",
    "Colonial interest in Nyasaland centered on agriculture due to lack of major mineral resources.",
    "Africans primarily practiced subsistence farming, growing maize, cassava, sorghum, and millet for home consumption.",
    "Farming tools and methods were basic, relying on hoes and manual labor.",
    "Shifting cultivation was widely used to allow land to regenerate after crop cycles.",
    "Frequent shifting led to deforestation and increased soil erosion.",
    "Low crop yields due to traditional methods and lack of soil improvement techniques.",
    "No formal agricultural extension services existed for African farmers.",
    "Trade in agricultural produce was limited; surplus was often bartered locally.",
    "Agriculture was not yet commercialized, and market linkages were minimal."
  ]
},

  {
    "title": "Estate Farming",
    "content": "Europeans grew cash crops like coffee, tea, cotton, and tobacco mainly in the Shire Highlands.",
    "points": [
      "Large tracts of fertile land were allocated to European settlers.",
      "Africans were pushed into marginal lands and crowded reserves.",
      "Africans became tenants on European-owned estates under exploitative conditions.",
      "Tenant farmers (thangata system) had to work part of the year to pay rent.",
      "Estate farming prioritized export crops over African food security.",
      "Land policies caused increased hunger, overuse of soil, and social tensions."
    ]
  },
  {
    "title": "Cash Crops and Challenges",
    "content": "Coffee failed due to disease and competition from Brazil; tea and tobacco became the dominant export crops.",
    "points": [
      "Tea thrived in cooler regions like Thyolo and Mulanje.",
      "Tobacco became the most profitable crop, grown in areas like Blantyre, Zomba, and Dowa.",
      "Cotton was cultivated in the Lower Shire but suffered from floods and limited labor.",
      "European estates used the tenant system to secure cheap labor for cash crop production.",
      "Africans were restricted from growing or marketing high-value cash crops independently.",
      "African-grown crops were often purchased below market value by estate owners.",
      "Global market fluctuations (e.g., Great Depression) hurt local farming economies."
    ]
  },
  {
    "title": "Challenges for African Farmers",
    "content": "African farmers struggled under colonial policies and lack of support.",
    "points": [
      "No access to credit or agricultural loans.",
      "Used outdated farming methods due to lack of training.",
      "Limited access to markets and fair pricing systems.",
      "Absence of agricultural extension services and education.",
      "No access to ginneries or processing equipment for cotton.",
      "Farming tools were basic and often homemade.",
      "Transport infrastructure (roads and rail) prioritized settler exports.",
      "Africans faced legal and policy barriers to land ownership and crop marketing.",
      "Environmental challenges like soil exhaustion and unreliable rainfall added to difficulties."
    ]
  },

    {
      "title": "Policy Changes",
      "content": "Government involved Africans more in commercial farming to reduce labor migration and meet European demand.",
      "points": [
        "Loans and cotton seeds distributed from 1904.",
        "Railway and ginneries built.",
        "Some land redistributed to Africans."
      ]
    },
    {
      "title": "Summary of Land, Taxation and Labour Policies",
      "content": "",
      "points": [
        "By 1891, large land areas acquired by European companies; 15% of Nyasaland’s land under European control by 1894.",
        "Land classified into Native Reserves, Crown Land, and Private Estates under 1936 Native Trust Lands Order.",
        "Nunan (1903) and Jackson (1920) Commissions attempted land reforms with limited success.",
        "Taxes introduced to fund administration and coerce labor; tax increases linked to labor shortages.",
        "Estate owners paid taxes for workers staying at least one month."
      ]
    },
    
  {
    "title": "The Mining Industry in Southern and Northern Rhodesia - Southern Rhodesia",
    "content": "BSA Company held mining rights; initial focus on gold, later coal, chrome, and asbestos.",
    "points": [
      "Initial focus was on gold mining, but attention shifted to coal (Wankie, 1903), chrome (Selukwe, 1906), and asbestos (Shabani, 1908).",
      "Mining attracted European settlers and investments.",
      "Stimulated infrastructure development like railways and towns (e.g., Bulawayo).",
      "Provided employment to thousands of African workers.",
      "Contributed to Southern Rhodesia's economy through export revenues.",
      "Mining required large-scale labor recruitment systems.",
      "Faced challenges including poor transport systems and high costs.",
      "Gold reefs were scattered and not very rich.",
      "There was a shortage of capital and modern machinery.",
      "Lacked skilled labor, increasing dependence on foreign experts.",
      "African workers faced racial discrimination, low wages, and long hours.",
      "Profits mainly benefitted European companies and settlers."
    ]
  },
  {
    "title": "The Mining Industry in Southern and Northern Rhodesia - Northern Rhodesia",
    "content": "Copper mines developed slowly due to capital and transport shortages; improved post-WWI with railway and demand.",
    "points": [
      "Main copper mining areas included Roan Antelope, Mufulira, Nkana, and Nchanga.",
      "Initial mining efforts were hampered by lack of transport, capital, and market demand.",
      "Post-WWI railway to the Copperbelt boosted mining activities.",
      "American and European demand in the 1920s increased copper production.",
      "Mining stimulated urban growth in towns like Kitwe, Ndola, and Luanshya.",
      "Created employment opportunities for thousands of African workers.",
      "Mining companies built hospitals, roads, schools, and housing.",
      "Contributed to colonial government revenue through taxes and royalties.",
      "Great Depression (1929) led to a sharp drop in copper prices and temporary mine closures.",
      "Harsh working conditions, low pay, and poor housing for African workers.",
      "Led to formation of labor unions and early political consciousness.",
      "Profits were largely taken by foreign investors and the BSA Company."
    ]
  },
  {
    "title": "Labour Migration from Nyasaland",
    "content": "Caused by land alienation, taxation, limited local jobs, and better wages abroad.",
    "points": [
      "Migration primarily to Southern Rhodesia, South Africa, and the Copperbelt (Zambia and Katanga).",
      "Migrants mainly from districts like Mzimba, Nkhata Bay, Dowa, and Ntcheu.",
      "Nyasa labor was preferred due to hard-working nature and low wage demands.",
      "Labour agencies like WENLA, NRNLA, and RNB regulated recruitment and contracts.",
      "Permits and quotas were introduced to control labor export.",
      "Contracts often included two-year work periods with return transport.",
      "Positive impacts included increased income for households.",
      "Migrants brought back consumer goods and built better homes.",
      "Contributed to infrastructure growth in home districts (e.g., roads, trading centers).",
      "Exposed Africans to new ideas, which led to early nationalism.",
      "Created small businesses and entrepreneurial activities back home.",
      "Negative impacts included shortage of labor in rural agriculture.",
      "Disrupted family life due to long-term male absence.",
      "Increased spread of STDs and social breakdown in home communities.",
      "Harsh working conditions abroad: poor housing, food, and low wages.",
      "Exploitation by employers and middlemen during recruitment."
    ]
  }
]
},


















    {
      "title": "Colonialism in Africa",
      "subsections": [
        {
          "title": "Definition",
          "content": "Colonialism was the period when African countries were ruled by foreign European powers.",
          "points": [
            "Foreign governments controlled land, people, and resources.",
            "It began in the late 19th century during the 'Scramble for Africa'."
          ]
        },
        {
          "title": "Major Colonial Powers",
          "content": "European countries that established colonies across Africa.",
          "points": [
            "Britain, France, Portugal, Germany, Belgium, and Italy.",
            "Each power imposed its language, laws, and systems."
          ]
        },
        {
          "title": "Effects of Colonialism",
          "content": "Colonialism had long-lasting impacts on African societies.",
          "points": [
            "Loss of independence and cultural identity.",
            "Exploitation of African resources and labor.",
            "Introduction of Western education, religion, and infrastructure."
          ]
        },
        {
          "title": "African Resistance",
          "content": "Africans resisted colonial rule in various ways.",
          "points": [
            "Armed uprisings (e.g. Maji Maji Rebellion in Tanzania).",
            "Political movements and traditional leadership opposition."
          ]
        }
      ]
    },
    {
      "title": "The Slave Trade",
      "subsections": [
        {
          "title": "Definition",
          "content": "The transatlantic slave trade involved the capture and transportation of Africans to work in the Americas.",
          "points": [
            "Began in the 15th century and lasted for over 400 years.",
            "Involved European traders and African middlemen."
          ]
        },
        {
          "title": "Impact on Africa",
          "content": "The slave trade severely affected African societies.",
          "points": [
            "Millions of Africans were forcibly taken from their homes.",
            "Communities were depopulated and weakened.",
            "Cultural heritage and social structures were disrupted."
          ]
        },
        {
          "title": "Abolition of the Slave Trade",
          "content": "Efforts to end the slave trade began in the 18th century.",
          "points": [
            "Led by abolitionists in Europe and America.",
            "Britain banned slave trade in 1807; slavery abolished in British colonies in 1833."
          ]
        }
      ]
    },
    {
      "title": "Malawi’s Path to Independence",
      "subsections": [
        {
          "title": "Background",
          "content": "Malawi, formerly Nyasaland, was under British colonial rule.",
          "points": [
            "Part of the Federation of Rhodesia and Nyasaland (1953–1963)."
          ]
        },
        {
          "title": "Independence Movement",
          "content": "Malawians organized themselves to fight for self-rule.",
          "points": [
            "Malawi Congress Party (MCP) was formed to demand independence.",
            "Protests, petitions, and political organization increased pressure on colonial authorities."
          ]
        },
        {
          "title": "Key Leader",
          "content": "Dr. Hastings Kamuzu Banda was the central figure in Malawi’s fight for independence.",
          "points": [
            "Returned from abroad in 1958 to lead the movement.",
            "Later became Malawi's first Prime Minister and President."
          ]
        },
        {
          "title": "Independence Achievement",
          "content": "Malawi gained independence on July 6, 1964.",
          "points": [
            "The country transitioned to self-governance.",
            "Celebrated annually as Malawi’s Independence Day."
          ]
        }
      ]
    }
  ]
}

