


{
  "subject": "Chemistry",
  "topics": [


    {
  "title": "Chemical Bonding",
  "subsections": [
    {
      "title": "Types of Chemical Bonds",
      "content": "There are three main types of chemical bonds that hold atoms or ions together in compounds.",
      "points": [
        "Ionic Bond – formed through transfer of electrons between metals and non-metals.",
        "Covalent Bond – formed through sharing of electrons between non-metal atoms.",
        "Metallic Bond – formed among metal atoms by attraction between ions and delocalised electrons."
      ]
    },
    {
      "title": "Ionic Bonding",
      "content": "Ionic bonding involves the transfer of electrons to form oppositely charged ions which attract each other.",
      "points": [
        "Formed between metals (which lose electrons) and non-metals (which gain electrons).",
        "Positive ion (cation) is formed when electrons are lost.",
        "Negative ion (anion) is formed when electrons are gained.",
        "Example: Na + Cl → NaCl, Mg + Cl₂ → MgCl₂, Ca + O → CaO.",
        "Structure: NaCl forms a giant ionic lattice with each Na⁺ surrounded by 6 Cl⁻ ions in a cube shape."
      ]
    },
    {
      "title": "Covalent Bonding",
      "content": "Covalent bonding involves sharing of electrons between non-metal atoms to achieve stable electron arrangements.",
      "points": [
        "Forms molecules instead of ions.",
        "Examples include: H₂, Cl₂, NH₃, H₂O, CO₂, N₂, O₂, CH₄.",
        "Each shared pair of electrons forms one covalent bond.",
        "Double and triple bonds are possible (e.g., CO₂ has double bonds; N₂ has a triple bond)."
      ]
    },
    {
      "title": "Metallic Bonding",
      "content": "In metallic bonding, metal atoms lose outer electrons that become free to move, creating a sea of delocalised electrons.",
      "points": [
        "These electrons are attracted to positive metal ions, forming strong metallic bonds.",
        "Explains properties like high electrical/thermal conductivity and malleability.",
        "Stronger metallic bonds form with more delocalised electrons or if the element is further right in the periodic table.",
        "Examples: Copper (Cu) and Aluminium (Al) – both conduct electricity well."
      ]
    },
    {
      "title": "Applications and Comparisons",
      "content": "Understanding bonding helps explain the properties and behaviours of elements and compounds.",
      "points": [
        "Dot and cross diagrams show how electrons are shared or transferred.",
        "Bonding in metals: Sea of delocalised electrons and positive ions.",
        "Covalent compounds like CO₂ have double bonds; CH₄ has single covalent bonds.",
        "Ionic vs Covalent bonding: transfer vs sharing of electrons, forms ions vs molecules, occurs between metals and non-metals vs non-metals only.",
        "Examples of formulas: KCl, CaF₂, Fe₂O₃, H₂O, Al₂O₃, CaBr₂, Na₂O, CO, SiH₄."
      ]
    },
    {
      "title": "Key Definitions and Examples",
      "content": "Definitions and specific examples help reinforce understanding of bonding types.",
      "points": [
        "Chemical bond: Force of attraction holding atoms or ions together.",
        "KCl: Ionic bond between potassium and chlorine; stable compound.",
        "Silane (SiH₄): Covalent bonding; 4 shared electrons between silicon and hydrogen.",
        "Better electrical conductors like copper have loosely held outer electrons."
      ]
    }
  ]
},


{
  "title": "Introduction to Hydrocarbons",
  "subsections": [
    {
      "title": "Introduction to Hydrocarbons",
      "content": "Hydrocarbons are compounds made of hydrogen and carbon only.\n\nOrganic chemistry is the study of carbon-containing compounds.",
      "points": [
        "Examples of hydrocarbons: petrol, kerosene, LPG (liquefied petroleum gas)."
      ]
    },
    {
      "title": "Oxycarbons",
      "content": "Compounds made of carbon and oxygen only.",
      "points": [
        "General formula: CₓOᵧ",
        "Examples: CO₂ (carbon dioxide), CO (carbon monoxide).",
        "Usually gases at room temperature."
      ]
    },
    {
      "title": "Catenation",
      "content": "Catenation is the ability of carbon atoms to bond with each other.",
      "points": [
        "Carbon forms long chains or rings.",
        "It can also bond with other elements like hydrogen (H), oxygen (O), etc."
      ]
    },
    {
      "title": "Hydrocarbons in Crude Oil",
      "content": "Crude oil is a mixture of hydrocarbons.",
      "points": [
        "Used as fuel and raw materials (e.g., plastics, fabrics)."
      ]
    },
    {
      "title": "Other Organic Compounds",
      "content": "",
      "points": [
        "Plant sources: carbohydrates, oils, rubber, textiles.",
        "Animal sources: proteins, fats."
      ]
    },
    {
      "title": "Homologous Series",
      "content": "A group of organic compounds with similar properties.",
      "points": [
        "Share a general formula.",
        "Each member differs by a CH₂ group.",
        "Prepared using similar methods.",
        "Gradual change in physical properties.",
        "Similar chemical reactions.",
        "Examples of Homologous Series: Alkanes, Alkenes, Alkynes, Alkanols, Alkanoic acids."
      ]
    },
    {
      "title": "Saturated vs. Unsaturated Hydrocarbons",
      "content": "",
      "points": [
        "Saturated Hydrocarbons (Alkanes): All carbon-carbon bonds are single. Each carbon is bonded to maximum number of hydrogen atoms.",
        "Unsaturated Hydrocarbons (Alkenes, Alkynes): Contain double or triple carbon-carbon bonds. Fewer hydrogen atoms attached.",
        "Example Saturated:\n H H\n C–C\n H H",
        "Example Unsaturated:\n H H\n C=C\n H H"
      ]
    },
    {
      "title": "Test for Unsaturation",
      "content": "Materials: Test tubes, Acidified potassium permanganate (KMnO₄), Bromine water, Test pipette.\n\nProcedure: Bubble ethene through KMnO₄ and bromine water – observe color changes.",
      "points": [
        "Ethene decolorizes KMnO₄ and bromine water.",
        "This confirms the presence of double or triple bonds.",
        "Ethane does not react as it has only single bonds (saturated)."
      ]
    },
    {
      "title": "Alkanes",
      "content": "Most common hydrocarbons. No functional group – chemically stable (inert).",
      "points": [
        "General formula: CnH₂n+2",
        "Useful for storing reactive elements like alkali metals.",
        "Common Alkanes: Methane, Ethane, Propane, Butane, Pentane, Hexane, Heptane, Octane, Nonane, Decane."
      ]
    },
    {
      "title": "Activity: Derive Molecular Formulas",
      "content": "",
      "points": [
        "Use the formula CnH₂n+2 to find molecular formulas of:",
        "Alkanes with 4 carbon atoms (C₄H₁₀)",
        "Alkanes with 5 carbon atoms (C₅H₁₂)",
        "Alkanes with 6 carbon atoms (C₆H₁₄)"
      ]
    },
    {
      "title": "Naming Alkanes",
      "content": "",
      "points": [
        "Name is based on number of carbon atoms.",
        "\"Meth\" = 1 carbon",
        "\"Eth\" = 2 carbons",
        "\"Prop\" = 3 carbons",
        "And so on..."
      ]
    },
    {
      "title": "Types of Formulae",
      "content": "",
      "points": [
        "Molecular formula – shows number of each atom.",
        "Structural formula – shows how atoms are bonded.",
        "Condensed formula – groups atoms together.",
        "Skeletal formula – uses lines to show carbon bonds.",
        "Activity: Draw alkanes with 6, 7, 8, 9, and 10 carbon atoms."
      ]
    },
    {
      "title": "Sources of Alkanes",
      "content": "Obtained by fractional distillation of crude oil.",
      "points": []
    },
    {
      "title": "Crude Oil",
      "content": "",
      "points": [
        "Thick, dark liquid with strong smell.",
        "Formed from dead plants and animals over millions of years.",
        "Contains many types of hydrocarbons."
      ]
    },
    {
      "title": "Fractional Distillation",
      "content": "",
      "points": [
        "Heated in a furnace.",
        "Vapors rise in a fractionating column (hot at bottom, cooler at top).",
        "Lighter compounds rise higher; heavier ones condense at the bottom.",
        "Final product is bitumen – used for roads."
      ]
    },
    {
      "title": "Preparation of Alkanes (Methane)",
      "content": "Heat sodium ethanoate with soda lime (NaOH + CaO).\nProduces methane and sodium carbonate.",
      "points": [
        "Equation: CnH₂n+1COONa + NaOH → CH₄ + Na₂CO₃"
      ]
    },
    {
      "title": "Physical Properties of Alkanes",
      "content": "",
      "points": [
        "Colourless",
        "Insoluble in water",
        "Soluble in organic solvents"
      ]
    },
    {
      "title": "Methane Specific Properties",
      "content": "",
      "points": [
        "Colourless, odourless gas",
        "Less dense than air"
      ]
    },
    {
      "title": "Chemical Properties of Alkanes",
      "content": "1. Combustion: Burn in oxygen to give CO₂ and H₂O. Release energy.",
      "points": [
        "Complete combustion: Blue, hot, clean flame. Example: 2C₂H₆ + 7O₂ → 4CO₂ + 6H₂O",
        "Incomplete combustion: Yellow, sooty flame. Example: CH₄ + O₂ → C + 2H₂O",
        "2. Substitution Reactions: Hydrogen replaced by halogens (Cl, Br, I).",
        "Steps:",
        "CH₄ + Cl₂ → CH₃Cl + HCl (Monochloromethane)",
        "CH₃Cl + Cl₂ → CH₂Cl₂ + HCl (Dichloromethane)",
        "CH₂Cl₂ + Cl₂ → CHCl₃ + HCl (Chloroform)",
        "CHCl₃ + Cl₂ → CCl₄ + HCl (Carbon tetrachloride)"
      ]
    },
    {
      "title": "Uses of Alkanes",
      "content": "",
      "points": [
        "Fuels (cooking, cars, machines)",
        "Candle wax",
        "Vaseline and grease",
        "Polish",
        "Lab solvents",
        "Bitumen for roads"
      ]
    }
  ]
},

{
  "title": "ALKENES",
  "subsections": [
    {
      "title": "Introduction to Alkenes",
      "content": "Alkenes are unsaturated hydrocarbons.\nThey contain at least one double covalent bond between two carbon atoms.\nGeneral formula: CₙH₂ₙ.\n\"Unsaturated\" means the molecule does not contain the maximum number of hydrogen atoms due to the double bond.\nThe first member of the alkene group is ethene (C₂H₄).",
      "points": [
        "Structure of Ethene:\n\n  H       H                       H       H\n   C  =  C        OR              C  =  C\n   H       H                       H       H"
      ]
    },
    {
      "title": "Naming of Alkenes",
      "content": "Based on the number of carbon atoms (same prefixes as alkanes):",
      "points": [
        "Ethene (2C), Propene (3C), Butene (4C), Pentene (5C), etc."
      ]
    },
    {
      "title": "Sources of Alkenes",
      "content": "",
      "points": [
        "A. Dehydration of Alcohols: Removal of water from alcohol using concentrated acids like sulphuric acid (H₂SO₄) or phosphoric acid (H₃PO₄). On heating, alcohol is converted into an alkene + water.",
        "General Equation: CₙH₂ₙ₊₁OH → CₙH₂ₙ + H₂O (alcohol → alkene + water).",
        "Experiment: Preparation of Ethene from Ethanol.",
        "Chemicals/Apparatus: Ethanol, Conc. sulphuric acid, Bromine water, Acidified potassium permanganate (KMnO₄).",
        "Procedure: Mix ethanol and conc. H₂SO₄, heat the mixture. Ethene gas is produced and bubbled through testing solutions.",
        "Observations: Gas is released, which decolorizes bromine water and acidified KMnO₄ confirming unsaturation (ethene).",
        "Reactions:",
        "Step 1 (formation of ethyl hydrogen sulphate): C₂H₅OH + H₂SO₄ → C₂H₅HSO₄ + H₂O.",
        "Step 2 (production of ethene): C₂H₅HSO₄ → C₂H₄ + H₂SO₄.",
        "Notes: Reaction is exothermic and must be cooled. Alcohol and acid are miscible. Dry porcelain promotes smooth boiling. Ethene gas is flammable and explosive; release first portion safely."
      ]
    },
    {
      "title": "Sources of Alkenes (continued)",
      "content": "",
      "points": [
        "B. Cracking of Hydrocarbons: Breaking long-chain hydrocarbons into shorter alkanes and alkenes.",
        "Example: C₆H₁₄ → C₄H₁₀ + C₂H₄ (Hexane → Butane + Ethene).",
        "Uses of Cracking: Produces more petrol and improves fuel quality through blending.",
        "Types of Cracking: Thermal cracking (high temperature), Catalytic cracking (heat + catalyst like Al₂O₃, SiO₂) at lower temperatures."
      ]
    },
    {
      "title": "Physical Properties of Alkenes",
      "content": "Ethene is a colourless, odourless gas.",
      "points": [
        "Insoluble in water.",
        "Soluble in organic solvents.",
        "States of first 6 alkenes:",
        "Gases: C₂H₄, C₃H₆, C₄H₈.",
        "Liquids: C₅H₁₀, C₆H₁₂.",
        "Boiling/melting points increase with the number of carbon atoms due to higher molecular mass."
      ]
    },
    {
      "title": "Chemical Properties of Alkenes",
      "content": "",
      "points": [
        "A. Combustion: Alkenes burn in air to produce CO₂ and H₂O. Highly flammable.",
        "Equation: C₂H₄ + 3O₂ → 2CO₂ + 2H₂O.",
        "B. Addition Reactions:",
        "1. Hydrogenation: Ethene + hydrogen → ethane (requires nickel catalyst at ~150°C). Equation: C₂H₄ + H₂ → C₂H₆.",
        "Structure:\n  H      H                  H     H\n   C = C  +  H–H  →  H–C – C–H\n   H      H                  H     H",
        "2. Hydration: Ethene reacts with conc. H₂SO₄ to form ethyl hydrogen sulphate, which then reacts with water to produce ethanol.",
        "Step 1: C₂H₄ + H₂SO₄ → C₂H₅OSO₃H.",
        "Step 2: C₂H₅OSO₃H + H₂O → C₂H₅OH + H₂SO₄.",
        "Alternative industrial method: C₂H₄ + H₂O (steam) → C₂H₅OH (ethanol production).",
        "3. Halogenation: Alkenes react with halogens (Cl₂, Br₂, I₂) across the double bond to form dihalides.",
        "Bromine water test identifies alkenes by decolorization.",
        "Example: C₂H₄ + Br₂ → C₂H₄Br₂ (Brown → Colourless).",
        "Structure:\n  H     H                  H     H\n   C = C  +  Br–Br  →  H–C – C–H\n   H     H                  Br    Br"
      ]
    },
    {
      "title": "Test for Unsaturation",
      "content": "",
      "points": [
        "Bromine water: Alkenes turn brown bromine water colourless.",
        "Acidified KMnO₄: Purple solution becomes colourless."
      ]
    },
    {
      "title": "Uses of Alkenes",
      "content": "",
      "points": [
        "Production of plastics (polyethene from ethene).",
        "Artificial ripening of fruits (e.g., bananas, mangoes).",
        "Industrial alcohol production (ethanol from ethene).",
        "Making paints, antifreeze, and detergents."
      ]
    }
  ]
},


    {
      "title": "States of Matter",
      "subsections": [
        {
          "title": "Definition",
          "content": "Matter exists in different states based on particle arrangement and energy.",
          "points": [
            "Solid, liquid, and gas are the three main physical states of matter."
          ]
        },
        {
          "title": "Properties of States",
          "content": "Each state has unique characteristics.",
          "points": [
            "Solids: Fixed shape and volume, particles closely packed.",
            "Liquids: No fixed shape, fixed volume, particles slide over each other.",
            "Gases: No fixed shape or volume, particles move freely and are compressible."
          ]
        },
        {
          "title": "Changes of State",
          "content": "Matter can change from one state to another by gaining or losing energy.",
          "points": [
            "Melting: Solid to liquid.",
            "Boiling: Liquid to gas.",
            "Condensation: Gas to liquid.",
            "Freezing: Liquid to solid.",
            "Sublimation: Solid to gas without becoming liquid."
          ]
        }
      ]
    }
  ]
}
