

{
  "subject": "Science",
  "topics": [
   
    {
  "title": "Biology Essay Questions (MANEB Past Papers 2023–2003)",
  "subsections": [
    {
      "title": "Questions",
      "content": "Biology MANEB Past Essay Questions from 2023 to 2003.",
      "points": [
        "2023: Describe any five first line defence mechanism.",
        "2023: Describe any five adaptations of human male reproduction organ to its function.",
        "2023: Describe any five functions of the liver related to digestion.",
        "2022: Describe how Pavlov showed conditioned reflex using his experiment on dog.",
        "2022: Describe the process of blood clotting.",
        "2022: Describe any five ways of controlling cancer disease.",
        "2021: Describe how carbon monoxide poisoning occur.",
        "2021: Explain any five first line defence.",
        "2021: Explain the theory of evolution by natural selection.",
        "2020: Describe any four adaptations of camels to their habitat.",
        "2020: Explain any five ways of controlling round worm infestation.",
        "2020: Describe breathing mechanism in human beings.",
        "2019: Describe any five causes of deficiency diseases.",
        "2019: Explain any five contraceptive methods.",
        "2019: Explain any five adaptations of mesophytes to their environment.",
        "2018: Explain any five problems associated with the nervous system.",
        "2018: Describe an experiment that can be conducted to estimate the population of particular weeds in a given field.",
        "2017: Explain any five impacts of human activities on freshwater and tropical savanna woodland ecosystem.",
        "2017: Describe an experiment to show that developing fruits contains an enzyme that digest starch.",
        "2016: Describe any five effects of exercise on breathing.",
        "2016: Describe an experiment that can be done to show that leaves contain different types of pigments.",
        "2015: Explain any five ways in which diseases can be prevented in a community.",
        "2015: Explain an experiment that can be done to investigate the effect of temperature on activity of trypsin on coagulated milk.",
        "2014: Describe five ways in which the disease of cholera outbreak in a community can be controlled.",
        "2014: Describe an experiment to show the effect of practice on hitting target.",
        "2013: Describe any five characteristics that enable fresh water plants in their habitat.",
        "2013: Explain any five vitamins and their respective functions.",
        "2012: Explain any five ways in which breast feeding is important.",
        "2012: Explain how one can estimate the population of fish in a pond.",
        "2011: Describe an experiment to show that light intensity affects the rate of transpiration.",
        "2011: Explain how carbon monoxide poisoning occurs.",
        "2010: Explain how urine is formed in the kidney of the human body.",
        "2010: Explain any five factors to consider before blood transfusion.",
        "2010: Describe an experiment to show the effects of exercise on breathing.",
        "2009: State any five contraceptive methods and state how each one works.",
        "2009: Explain any five causes of environmental degradation and their effects.",
        "2009: Describe an experiment that can be done to show that germinated bean seed contains an enzyme that digest starch.",
        "2008: Discuss the energy flow in the tropical woodland. Your answer should be in an essay form.",
        "2008: Explain any five ways in which one can undertake to prevent Malaria.",
        "2008: Describe an experiment that can be carried out to show that fresh green leaves contain three types of pigments.",
        "2007: Describe any five problems associated with the human reproductive system and state how each can be controlled.",
        "2007: Describe how the population of plants in an open field can be estimated.",
        "2007: Describe any five ways in which a bird is adapted to overcome gravity.",
        "2006: Describe the breathing mechanism in human beings. Your answer should be in an essay form.",
        "2006: Describe an experiment to find out the region that responds to stimulus of gravity in bean seedlings.",
        "2006: Describe any five problems that result from rapid human population growth and how they could be controlled.",
        "2005: Explain any five components of human blood and explain their function.",
        "2005: Describe an experiment that you would do to show that transpiration affects uptake of water.",
        "2005: Suppose there is an outbreak of cholera in a boarding school. Describe how you would establish the cause of the disease.",
        "2004: Explain any five ways in which glucose is used by the plant after photosynthesis.",
        "2004: Explain the mechanism of breathing in fish.",
        "2004: Describe an experiment that can be conducted to find out the effects of unequal distribution of light on a plant shoot.",
        "2003: State five contraceptive methods a couple can use to prevent conception for four years and explain how each works.",
        "2003: Describe any five barriers the body uses to prevent entry of disease-causing organisms. Explain how each barrier works.",
        "2003: Design an experiment to estimate the population of grasshoppers in a school garden."
      ]
    }
  ]
},

{
  "title": "Chemistry – Form 4",
  "subsections": [
    {
      "title": "Water",
      "content": "Structured questions on water from secondary science curriculum.",
      "points": [
        "List three natural sources of water.",
        "Outline five main stages in the water cycle.",
        "State three physical properties of water.",
        "Give three distinct roles of water in biological or industrial processes.",
        "Identify two categories of water hardness.",
        "Name two dissolved salts responsible for hard water.",
        "List three effects of hard water on domestic activities or equipment.",
        "State two methods used to soften or remove hardness from water.",
        "Identify three major sources of water pollution.",
        "List three environmental or health effects of polluted water.",
        "Suggest three measures that can be taken to prevent water pollution.",
        "Investigating the hardness and softness of water using soap (Aim, Materials, Procedure, and Results).",
        "Outline three methods used to remove hardness from water. (Include both physical and chemical methods.)",
        "Explain the difference between physical and chemical methods of softening hard water.",
        "Describe an experiment that can be used to demonstrate the removal of temporary hardness in water. (Include the materials, procedure, observations, and conclusion.)"
      ]
    },
    {
      "title": "Greenhouse Gases and Ozone Layer",
      "content": "Environmental science questions on atmosphere, greenhouse gases, and ozone.",
      "points": [
        "List two natural disasters that affect the atmosphere.",
        "Explain how volcanic eruptions affect atmospheric conditions.",
        "State two ways in which bush fires affect air quality.",
        "Describe how deforestation contributes to atmospheric imbalance.",
        "Explain two effects of burning organic fuels on the atmosphere.",
        "State two human activities that lead to air pollution.",
        "Outline three consequences of poor air quality on human health.",
        "What are greenhouse gases?",
        "Name four greenhouse gases and state one source for each.",
        "State three sources of carbon dioxide emissions.",
        "Explain how methane contributes to global warming.",
        "Compare the global warming potential of carbon dioxide and methane.",
        "State three environmental effects of increased greenhouse gas emissions.",
        "Explain how greenhouse gases lead to the greenhouse effect.",
        "List three strategies that can be used to reduce the effects of greenhouse gases.",
        "Discuss the role of disaster risk management institutions in mitigating climate change.",
        "What is meant by ‘air quality standards’?",
        "Mention two ways governments or organizations can enforce air quality standards.",
        "Describe the position of the ozone layer in the atmosphere.",
        "Explain two functions of the ozone layer.",
        "What are chlorofluorocarbons (CFCs)?",
        "Explain how CFCs deplete the ozone layer.",
        "List three sources of CFCs in everyday life.",
        "Describe two problems caused by ozone layer depletion.",
        "State three health effects of excessive exposure to ultraviolet (UV) rays due to ozone depletion.",
        "Outline three ways to prevent or reduce ozone layer depletion.",
        "Discuss the combined effects of deforestation and fossil fuel combustion on atmospheric pollution and climate change.",
        "Explain the greenhouse effect and describe how it contributes to global warming. Include sources of major greenhouse gases.",
        "Describe the role of the ozone layer and explain the impact of its depletion on living organisms.",
        "Evaluate the effectiveness of current measures taken by global or national institutions to manage air pollution and climate change."
      ]
    },
    {
      "title": "Polymerisation",
      "content": "Questions covering the topic of polymers and polymerisation processes.",
      "points": [
        "Define the term polymer.",
        "What is a monomer? Give one example.",
        "Name two examples of natural polymers.",
        "Name two examples of synthetic polymers.",
        "State the difference between a monomer and a polymer.",
        "List four examples of polymers (two natural and two synthetic).",
        "Name the two main types of polymerisation.",
        "What is addition polymerisation?",
        "What is condensation polymerisation?",
        "Give one example of a polymer formed by addition polymerisation.",
        "Give one example of a polymer formed by condensation polymerisation.",
        "State one difference between addition and condensation polymerisation.",
        "List three properties of synthetic polymers.",
        "State three uses of synthetic polymers.",
        "Why are synthetic polymers widely used in modern life?",
        "What are thermosoftening plastics?",
        "What are thermosetting plastics?",
        "State two differences between thermosoftening and thermosetting plastics.",
        "List two examples of thermosoftening plastics.",
        "List two examples of thermosetting plastics.",
        "Why can't thermosetting plastics be reshaped once moulded?",
        "Describe the process of addition polymerisation and name a polymer formed by this process.",
        "Explain the difference between thermosoftening and thermosetting plastics, giving examples of each.",
        "Discuss the importance of polymers in everyday life and outline two environmental concerns related to their use.",
        "Describe with examples how natural and synthetic polymers differ in terms of source and usage."
      ]
    },
    {
      "title": "Waste Management",
      "content": "Comprehensive coverage of waste types, treatment, disposal, and minimization.",
      "points": [
        "Classify waste based on physical state.",
        "Classify waste based on degradability.",
        "Give two examples of each type of waste based on physical state (solid, liquid, gas).",
        "What is biodegradable waste? Give two examples.",
        "What is non-biodegradable waste? Give two examples.",
        "List four major sources of waste.",
        "Give two examples of wastes produced from domestic sources.",
        "Give two examples of wastes produced from industrial sources.",
        "Name two wastes produced from agricultural activities.",
        "Identify two wastes generated from medical and laboratory sources respectively.",
        "Describe the physical characteristics used to identify waste.",
        "Describe the chemical characteristics used to identify waste.",
        "List four methods used to treat waste.",
        "Explain how incineration helps in waste treatment.",
        "Describe two methods of waste disposal.",
        "State two advantages and two disadvantages of landfills.",
        "Explain one advantage and one disadvantage of incineration.",
        "What is a damp-site in relation to waste disposal?",
        "List three ways to minimize waste production.",
        "Explain the difference between reusing and recycling.",
        "Describe the process of recycling metals.",
        "Explain the benefits of recycling plastics.",
        "Why is waste minimization important in environmental conservation?"
      ]
    },
    {
      "title": "Rates of Reactions",
      "content": "Chemistry questions on factors, measurements, and investigation of reaction rates.",
      "points": [
        "Define the term “rate of reaction.”",
        "List four factors that affect the rate of a chemical reaction.",
        "Explain how temperature affects the rate of a reaction.",
        "Describe the effect of surface area on the rate of reaction.",
        "What role do catalysts play in chemical reactions?",
        "How does the concentration of reactants influence the rate of reaction?",
        "Describe two methods for measuring the rate of a reaction.",
        "How can the rate of reaction be determined by measuring the volume of gas produced?",
        "Explain how changes in mass of reactants can be used to measure reaction rate.",
        "What information can be obtained from plotting volume or mass against time graphs during a reaction?",
        "Define reversible and irreversible reactions.",
        "Give one example of a reversible reaction and describe how it can be investigated experimentally.",
        "Give one example of an irreversible reaction and describe how it can be investigated experimentally.",
        "Explain the difference between reversible and irreversible reactions in terms of product formation."
      ]
    }
  ]
},
 

    {
      "title": "Physics Fundamentals",
      "subsections": [
        {
          "title": "Questions",
          "content": "Answer these questions on physics fundamentals.",
          "points": [
            "Who formulated the laws of motion? \nOptions: Albert Einstein, Isaac Newton, Galileo Galilei, Nikola Tesla\nAnswer: Isaac Newton",
            "What is the unit of force? \nOptions: Newton, Joule, Watt, Pascal\nAnswer: Newton"
          ]
        }
      ]
    }
  ]
}
