

{
  "subject": "Science",
  "topics": [
   
    {
  "title": "Physics Essay Questions (MANEB Past Papers)",
  "subsections": [
    {
      "title": "Density",
      "content": "Physics MANEB essay questions on Density.",
      "points": [
        "2023: Define density and explain how it can be measured experimentally.",
        "2022: Describe an experiment to determine the density of an irregular solid.",
        "2021: Explain how density varies with temperature and give an example.",
        "2020: Discuss the relationship between density and buoyancy.",
        "2019: Describe the method to find the density of a liquid using a hydrometer.",
        "2018: Explain why ice floats on water using the concept of density.",
        "2017: Describe how density is used to identify substances.",
        "2016: Explain how density differences cause convection currents in fluids."
      ]
    },
    {
      "title": "Light",
      "content": "Physics MANEB essay questions on Light.",
      "points": [
        "2023: Describe an experiment to show that light travels in a straight line.",
        "2022: Explain how a pinhole camera forms an image.",
        "2021: Describe the laws of reflection of light.",
        "2020: Explain the phenomenon of refraction and its applications.",
        "2019: Discuss how a prism disperses white light into a spectrum.",
        "2018: Describe how a convex lens can be used to form a real image.",
        "2017: Explain the formation of shadows and eclipses.",
        "2016: Discuss the importance of total internal reflection in optical fibers."
      ]
    },
    {
      "title": "Electrostatics",
      "content": "Physics MANEB essay questions on Electrostatics.",
      "points": [
        "2023: Define electrostatics and explain how charged objects interact.",
        "2022: Describe an experiment to demonstrate charging by friction.",
        "2021: Explain the concept of electric field and its direction.",
        "2020: Discuss how an electroscope can detect electric charge.",
        "2019: Describe the law of conservation of charge with examples.",
        "2018: Explain the difference between conductors and insulators.",
        "2017: Discuss the forces between two charged objects using Coulomb’s law.",
        "2016: Explain the effect of grounding a charged object."
      ]
    },
    {
      "title": "Thermal Expansion",
      "content": "Physics MANEB essay questions on Thermal Expansion.",
      "points": [
        "2023: Define thermal expansion and describe the types of expansion.",
        "2022: Describe an experiment to measure linear expansion of a metal rod.",
        "2021: Explain why gaps are left between rails on a railway track.",
        "2020: Discuss how thermal expansion can cause cracks in roads.",
        "2019: Explain the effect of temperature on volume of gases.",
        "2018: Describe the practical uses of thermal expansion in bimetallic strips.",
        "2017: Explain how mercury in a thermometer expands with temperature.",
        "2016: Discuss how thermal expansion is considered in construction engineering."
      ]
    },
    {
      "title": "Transfer of Heat",
      "content": "Physics MANEB essay questions on Transfer of Heat.",
      "points": [
        "2023: Describe the three methods of heat transfer with examples.",
        "2022: Explain conduction and describe an experiment to show heat conduction.",
        "2021: Discuss convection currents and their role in weather phenomena.",
        "2020: Describe radiation and explain how it differs from conduction and convection.",
        "2019: Explain how heat transfer affects the design of thermal insulation.",
        "2018: Describe an experiment to demonstrate heat transfer by convection in liquids.",
        "2017: Discuss the greenhouse effect in terms of heat transfer.",
        "2016: Explain why metals feel colder than wood at room temperature."
      ]
    },
    {
      "title": "Heat Capacity",
      "content": "Physics MANEB essay questions on Heat Capacity.",
      "points": [
        "2023: Define heat capacity and specific heat capacity.",
        "2022: Describe an experiment to determine the specific heat capacity of a solid.",
        "2021: Explain how heat capacity affects temperature change in substances.",
        "2020: Discuss why water is used as a coolant in car engines based on heat capacity.",
        "2019: Explain the difference between heat capacity and specific heat capacity.",
        "2018: Describe how to calculate the energy required to raise the temperature of a substance.",
        "2017: Discuss the factors that affect the heat capacity of a material.",
        "2016: Explain how specific heat capacity relates to climate moderation by oceans."
      ]
    }
  ]
},

 

    {
      "title": "Physics Fundamentals",
      "subsections": [
        {
          "title": "Questions",
          "content": "Answer these questions on physics fundamentals.",
          "points": [
            "Who formulated the laws of motion? \nOptions: Albert Einstein, Isaac Newton, Galileo Galilei, Nikola Tesla\nAnswer: Isaac Newton",
            "What is the unit of force? \nOptions: Newton, Joule, Watt, Pascal\nAnswer: Newton"
          ]
        }
      ]
    }
  ]
}
